Kaggle Competition: Titanic Dataset Analysis

In [0]:
import pandas as pd
import matplotlib as plt 
import numpy as np 

%matplotlib inline

In [0]:
from google.colab import files
uploaded = files.upload()

Saving test.csv to test.csv
Saving train.csv to train.csv

In [0]:
train_df = pd.read_csv("train.csv")
test_df = pd.read_csv("test.csv")

In [0]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [0]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Can be seen that cabins has the most amount of NaN values, followed by the ages. These can be removed, since they won't be influencing the survival much.

In [0]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [0]:
train_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [0]:
train_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#PassengerID

In [0]:
train_df['PassengerId'].isna()

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
861    False
862    False
863    False
864    False
865    False
866    False
867    False
868    False
869    False
870    False
871    False
872    False
873    False
874    False
875    False
876    False
877    False
878    False
879    False
880    False
881    False
882    False
883    False
884    False
885    False
886    False
887    False
888    False
889    False
890    False
Name: PassengerId, Length: 891, dtype: bool

Since all values are unique, we can drop the column

In [0]:
train_df.drop('PassengerId',axis=1,inplace=True)

#Name
All the names are unique, except the title(Mr,Mrs., etc.). Try to remove the names and only keep the titles.

In [0]:
dfs = [train_df,test_df]
for df in dfs:
  df['Title'] = df['Name'].str.extract('([A-Za-z]+)\.', expand=False)

In [0]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr

In [0]:
train_df['Title'].value_counts()

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Major         2
Col           2
Mlle          2
Lady          1
Ms            1
Capt          1
Jonkheer      1
Sir           1
Mme           1
Countess      1
Don           1
Name: Title, dtype: int64

Map the titles to numbers: Mr:0, Miss:1, Mrs:2, Rest: 3

In [0]:
title_map = {"Mr":0 , "Miss":1, "Mrs":2, "Master":3, "Dr":3, "Rev":3, "Col":3, "Major":3, "Mlle": 3, "Don":3, "Mme":3, "Ms":3, "Countess":3, "Sir":3, "Lady":3, "Capt":3, "Jonkheer":3}

In [0]:
for df in dfs:
  df['Title'] = df['Title'].map(title_map)

In [0]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [0]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
Title          417 non-null float64
dtypes: float64(3), int64(4), object(5)
memory usage: 39.3+ KB

In [0]:
test_df['Title'].value_counts()

0.0    240
1.0     78
2.0     72
3.0     27
Name: Title, dtype: int64

In [0]:
test_df['Title'].fillna(0.0)

In [0]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null int64
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           418 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
Title          417 non-null float64
FamilySize     418 non-null int64
dtypes: float64(3), int64(6), object(4)
memory usage: 42.5+ KB

#Sex
Map male/female to 0/1

In [0]:
sex_map = {"male":0, "female":1}
for df in dfs: 
  df['Sex'] = df['Sex'].map(sex_map)

In [0]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,2
2,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,2
4,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S,0

#Age

In [0]:
train_df['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
28.00    25
21.00    24
25.00    23
36.00    22
29.00    20
32.00    18
27.00    18
35.00    18
26.00    18
16.00    17
31.00    17
20.00    15
33.00    15
23.00    15
34.00    15
39.00    14
17.00    13
42.00    13
40.00    13
45.00    12
38.00    11
50.00    10
2.00     10
4.00     10
47.00     9
         ..
71.00     2
59.00     2
63.00     2
0.83      2
30.50     2
70.00     2
57.00     2
0.75      2
13.00     2
10.00     2
64.00     2
40.50     2
32.50     2
45.50     2
20.50     1
24.50     1
0.67      1
14.50     1
0.92      1
74.00     1
34.50     1
80.00     1
12.00     1
36.50     1
53.00     1
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

Create intervals for age :
<=16: Child(0)
17-50: Middle-Aged(1)
50+: Old(2)

In [0]:
#fill null columns with median age
for df in dfs:
  df['Age'].fillna(df.groupby("Title")["Age"].transform("median"), inplace=True)
 
for df in dfs:
  df.loc[ df['Age'] <= 17, 'Age'] = 0,
  df.loc[(df['Age'] > 17) & (df['Age'] <= 50), 'Age'] = 1,
  df.loc[ df['Age'] > 50, 'Age'] = 2

In [0]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,0,3,"Braund, Mr. Owen Harris",0,1.0,1,0,A/5 21171,7.2500,NaN,S,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1.0,1,0,PC 17599,71.2833,C85,C,2
2,1,3,"Heikkinen, Miss. Laina",1,1.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1.0,1,0,113803,53.1000,C123,S,2
4,0,3,"Allen, Mr. William Henry",0,1.0,0,0,373450,8.0500,NaN,S,0

In [0]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null int64
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
Title          417 non-null float64
dtypes: float64(3), int64(5), object(4)
memory usage: 39.3+ KB

#Family Size
Family size of a person = SibSp(number of siblings) + Parch(number of parents/children) + 1(him/herself)

In [0]:
for df in dfs:
  df['FamilySize'] = df['SibSp'] + df['Parch'] + 1

In [0]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,FamilySize
0,0,3,"Braund, Mr. Owen Harris",0,1.0,1,0,A/5 21171,7.2500,NaN,S,0,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1.0,1,0,PC 17599,71.2833,C85,C,2,2
2,1,3,"Heikkinen, Miss. Laina",1,1.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1.0,1,0,113803,53.1000,C123,S,2,2
4,0,3,"Allen, Mr. William Henry",0,1.0,0,0,373450,8.0500,NaN,S,0,1

In [0]:
train_df['FamilySize'].value_counts()

1     537
2     161
3     102
4      29
6      22
5      15
7      12
11      7
8       6
Name: FamilySize, dtype: int64

Divide family sizes into intervals:
<=2: Small(0)
 3-5: Medium(1)
 6+: Large(2)

In [0]:
for df in dfs:
  df.loc[ df['FamilySize'] <= 2, 'FamilySize'] = 0,
  df.loc[(df['FamilySize'] > 2) & (df['FamilySize'] <= 5), 'FamilySize'] = 1,
  df.loc[ df['FamilySize'] > 5, 'FamilySize'] = 2
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,FamilySize
0,0,3,"Braund, Mr. Owen Harris",0,1.0,1,0,A/5 21171,7.2500,NaN,S,0,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1.0,1,0,PC 17599,71.2833,C85,C,2,0
2,1,3,"Heikkinen, Miss. Laina",1,1.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1.0,1,0,113803,53.1000,C123,S,2,0
4,0,3,"Allen, Mr. William Henry",0,1.0,0,0,373450,8.0500,NaN,S,0,0

#Fare

In [0]:
train_df['Fare'].value_counts()

8.0500      43
13.0000     42
7.8958      38
7.7500      34
26.0000     31
10.5000     24
7.9250      18
7.7750      16
26.5500     15
0.0000      15
7.2292      15
7.8542      13
8.6625      13
7.2500      13
7.2250      12
16.1000      9
9.5000       9
24.1500      8
15.5000      8
56.4958      7
52.0000      7
14.5000      7
14.4542      7
69.5500      7
7.0500       7
31.2750      7
46.9000      6
30.0000      6
7.7958       6
39.6875      6
            ..
7.1417       1
42.4000      1
211.5000     1
12.2750      1
61.1750      1
8.4333       1
51.4792      1
7.8875       1
8.6833       1
7.5208       1
34.6542      1
28.7125      1
25.5875      1
7.7292       1
12.2875      1
8.6542       1
8.7125       1
61.3792      1
6.9500       1
9.8417       1
8.3000       1
13.7917      1
9.4750       1
13.4167      1
26.3875      1
8.4583       1
9.8375       1
8.3625       1
14.1083      1
17.4000      1
Name: Fare, Length: 248, dtype: int64

In [0]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
Survived      891 non-null int64
Pclass        891 non-null int64
Name          891 non-null object
Sex           891 non-null int64
Age           891 non-null float64
SibSp         891 non-null int64
Parch         891 non-null int64
Ticket        891 non-null object
Fare          891 non-null float64
Cabin         204 non-null object
Embarked      889 non-null object
Title         891 non-null int64
FamilySize    891 non-null int64
dtypes: float64(2), int64(7), object(4)
memory usage: 90.6+ KB

In [0]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null int64
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
Title          417 non-null float64
FamilySize     418 non-null int64
dtypes: float64(3), int64(6), object(4)
memory usage: 42.5+ KB

In [0]:
test_df['Fare'].fillna(test_df.groupby("Title")["Fare"].transform("median"), inplace=True)

Dividing the fares into 3 main categories:
Cheap: 0-20 (0)
Mid-range: 20--40 (1)
Expensive: 40+ (2)

In [0]:
for df in dfs:
  df.loc[ df['Fare'] <= 20, 'Fare'] = 0,
  df.loc[(df['Fare'] > 20) & (df['Fare'] <= 40), 'Fare'] = 1,
  df.loc[ df['Fare'] > 40, 'Fare'] = 2

In [0]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,FamilySize
0,0,3,"Braund, Mr. Owen Harris",0,1.0,1,0,A/5 21171,0.0,NaN,S,0,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1.0,1,0,PC 17599,2.0,C85,C,2,0
2,1,3,"Heikkinen, Miss. Laina",1,1.0,0,0,STON/O2. 3101282,0.0,NaN,S,1,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1.0,1,0,113803,2.0,C123,S,2,0
4,0,3,"Allen, Mr. William Henry",0,1.0,0,0,373450,0.0,NaN,S,0,0

In [0]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null int64
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           418 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
Title          417 non-null float64
FamilySize     418 non-null int64
dtypes: float64(3), int64(6), object(4)
memory usage: 42.5+ KB

#Cabin

In [0]:
train_df['Cabin'].value_counts()

B96 B98        4
C23 C25 C27    4
G6             4
F2             3
D              3
C22 C26        3
F33            3
E101           3
B20            2
B18            2
C78            2
C92            2
B28            2
E33            2
C68            2
F4             2
C83            2
B49            2
C52            2
C123           2
E44            2
C93            2
B77            2
B51 B53 B55    2
D36            2
C124           2
C65            2
B35            2
E8             2
C126           2
              ..
E58            1
D48            1
C99            1
C104           1
T              1
A26            1
C91            1
C50            1
D10 D12        1
C7             1
A32            1
B94            1
B101           1
D46            1
F38            1
C32            1
E36            1
F G63          1
C148           1
C62 C64        1
C111           1
D30            1
E38            1
E40            1
E17            1
B38            1
D21            1
D11            1
A6             1
C95            1
Name: Cabin, Length: 147, dtype: int64

Transform cabin column: it can be seen that columns start with A,B,C, etc. Replace the NaN values with a standard cabin, S

In [0]:
for df in dfs:
  df['Cabin'] = df['Cabin'].str[:1].fillna('S')

In [0]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,FamilySize
0,0,3,"Braund, Mr. Owen Harris",0,1.0,1,0,A/5 21171,0.0,S,S,0,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1.0,1,0,PC 17599,2.0,C,C,2,0
2,1,3,"Heikkinen, Miss. Laina",1,1.0,0,0,STON/O2. 3101282,0.0,S,S,1,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1.0,1,0,113803,2.0,C,S,2,0
4,0,3,"Allen, Mr. William Henry",0,1.0,0,0,373450,0.0,S,S,0,0

Map cabin types to numbers

In [0]:
train_df['Cabin'].value_counts()

S    687
C     59
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: Cabin, dtype: int64

In [0]:
Cabin_map = {"A": 0, "B": 0.4, "C": 0.8, "D": 1.2, "E": 1.6, "F": 2, "G": 2.4, "T": 2.8, "S": 3.0}
for df in dfs:
  df['Cabin'] = df['Cabin'].map(Cabin_map)

In [0]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,FamilySize
0,0,3,"Braund, Mr. Owen Harris",0,1.0,1,0,A/5 21171,0.0,3.0,S,0,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1.0,1,0,PC 17599,2.0,0.8,C,2,0
2,1,3,"Heikkinen, Miss. Laina",1,1.0,0,0,STON/O2. 3101282,0.0,3.0,S,1,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1.0,1,0,113803,2.0,0.8,S,2,0
4,0,3,"Allen, Mr. William Henry",0,1.0,0,0,373450,0.0,3.0,S,0,0

In [0]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null int64
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           418 non-null float64
Cabin          418 non-null float64
Embarked       418 non-null object
Title          417 non-null float64
FamilySize     418 non-null int64
dtypes: float64(4), int64(6), object(3)
memory usage: 42.5+ KB

#Embarked

In [0]:
train_df['Embarked'].isnull().sum()

2

In [0]:
Embarked_map = {'S': 0, 'C' : 1, 'Q' : 2}
for df in dfs:
  df['Embarked'] =df['Embarked'].fillna("S")
  df['Embarked'] = df['Embarked'].map(Embarked_map)

In [0]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,FamilySize
0,0,3,"Braund, Mr. Owen Harris",0,1.0,1,0,A/5 21171,0.0,3.0,0,0,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1.0,1,0,PC 17599,2.0,0.8,1,2,0
2,1,3,"Heikkinen, Miss. Laina",1,1.0,0,0,STON/O2. 3101282,0.0,3.0,0,1,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1.0,1,0,113803,2.0,0.8,0,2,0
4,0,3,"Allen, Mr. William Henry",0,1.0,0,0,373450,0.0,3.0,0,0,0

In [0]:
test_df['Title'].fillna(0)

In [0]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null int64
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           418 non-null float64
Cabin          418 non-null float64
Embarked       418 non-null int64
Title          417 non-null float64
FamilySize     418 non-null int64
dtypes: float64(4), int64(7), object(2)
memory usage: 42.5+ KB

#Drop unused rows
Data is ready to be modelled once the unused rows are dropped. These are : Name, SibSp, Parch, Ticket

In [0]:
unused_cols = ['Name','Ticket', 'SibSp', 'Parch']
for df in dfs:
  df.drop(unused_cols,axis=1,inplace=True)

In [0]:
train_df.head()

   Survived  Pclass  Sex  Age  Fare  Cabin  Embarked  Title  FamilySize
0         0       3    0  1.0   0.0    3.0         0      0           0
1         1       1    1  1.0   2.0    0.8         1      2           0
2         1       3    1  1.0   0.0    3.0         0      1           0
3         1       1    1  1.0   2.0    0.8         0      2           0
4         0       3    0  1.0   0.0    3.0         0      0           0

In [0]:
test_df.head()

   PassengerId  Pclass  Sex  Age  Fare  Cabin  Embarked  Title  FamilySize
0          892       3    0  1.0   0.0    3.0         2    0.0           0
1          893       3    1  1.0   0.0    3.0         0    2.0           0
2          894       2    0  2.0   0.0    3.0         2    0.0           0
3          895       3    0  1.0   0.0    3.0         0    0.0           0
4          896       3    1  1.0   0.0    3.0         0    2.0           1

#Separate the survived  column from the table

In [0]:
target = train_df['Survived']
train_df.drop('Survived',axis=1,inplace=True)

In [0]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [0]:
train_df.head()

   Pclass  Sex  Age  Fare  Cabin  Embarked  Title  FamilySize
0       3    0  1.0   0.0    3.0         0      0           0
1       1    1  1.0   2.0    0.8         1      2           0
2       3    1  1.0   0.0    3.0         0      1           0
3       1    1  1.0   2.0    0.8         0      2           0
4       3    0  1.0   0.0    3.0         0      0           0

#Modelling

In [0]:

# Importing Classifier Modules
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import SVC

import numpy as np

In [0]:
train_df.info() #no null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Pclass        891 non-null int64
Sex           891 non-null int64
Age           891 non-null float64
Fare          891 non-null float64
Cabin         891 non-null float64
Embarked      891 non-null int64
Title         891 non-null int64
FamilySize    891 non-null int64
dtypes: float64(3), int64(5)
memory usage: 55.8 KB

In [0]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Sex            418 non-null int64
Age            418 non-null float64
Fare           418 non-null float64
Cabin          418 non-null float64
Embarked       418 non-null int64
Title          417 non-null float64
FamilySize     418 non-null int64
dtypes: float64(4), int64(5)
memory usage: 29.5 KB

In [0]:
from sklearn.model_selection import train_test_split
X_train = train_df[['Pclass','Sex','Age','Fare','Cabin','Embarked','FamilySize']]
X_test = test_df[['Pclass','Sex','Age','Fare','Cabin','Embarked','FamilySize']]
y = target
X_NewTrain, X_NewTest,y_NewTrain, y_NewTest = train_test_split(X_train, y,
                                         test_size=0.33, # 1/3 test; 2/3 train
                                          random_state=1410) # seed

In [0]:
classifiers = [KNeighborsClassifier(),DecisionTreeClassifier(),RandomForestClassifier(),GaussianNB(),SVC()]

In [0]:
for classifier in classifiers:
  name = classifier.__class__.__name__
  classifier.fit(X_NewTrain, y_NewTrain)
  prediction = classifier.predict(X_NewTest)
  rank = pd.DataFrame(data=np.column_stack([prediction, y_NewTest]),
                              index=X_NewTest.index.values,columns=['Predicted','Real'])
  acc = np.sum(rank.Predicted.values == rank.Real.values)
  accurracy = acc/len(y_NewTest)
  print(accurracy, name)

0.7966101694915254 KNeighborsClassifier
0.7762711864406779 DecisionTreeClassifier
0.7864406779661017 RandomForestClassifier
0.7457627118644068 GaussianNB
0.8 SVC

/usr/local/lib/python3.6/dist-packages/sklearn/ensemble/forest.py:246: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)
/usr/local/lib/python3.6/dist-packages/sklearn/svm/base.py:196: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

In [0]:
svcModel = SVC()
svcModel.fit(X_train,y)
prediction = svcModel.predict(X_test)
prediction_df = pd.DataFrame(data=prediction,index = test_df.index.values,columns=['Survived'])

/usr/local/lib/python3.6/dist-packages/sklearn/svm/base.py:196: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

In [0]:
prediction_df.head()

   Survived
0         0
1         1
2         0
3         0
4         1

In [0]:
final = pd.DataFrame({"PassengerId":test_df['PassengerId'],
                     "Survived": prediction})
final.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [0]:
final.to_csv('submission.csv', index=False)

In [0]:
submission = pd.read_csv('submission.csv')
submission

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
5            897         0
6            898         1
7            899         0
8            900         1
9            901         0
10           902         0
11           903         0
12           904         1
13           905         0
14           906         1
15           907         1
16           908         0
17           909         0
18           910         1
19           911         1
20           912         0
21           913         0
22           914         1
23           915         0
24           916         1
25           917         0
26           918         1
27           919         0
28           920         0
29           921         0
..           ...       ...
388         1280         0
389         1281         0
390         1282         0
391         1283         1
392         1284         0
393         1285         0
394         1286         0
395         1287         1
396         1288         0
397         1289         1
398         1290         0
399         1291         0
400         1292         1
401         1293         0
402         1294         1
403         1295         0
404         1296         0
405         1297         0
406         1298         0
407         1299         0
408         1300         1
409         1301         1
410         1302         1
411         1303         1
412         1304         1
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]